Repository: kuma35/sed47doc-jp
Catalog: sed47doc-jp-level2.tmx
Source language: en_us
Languages: ja

source: This document will refer to “the” sed script; this is understood to mean the in-order concatenation of all of the scripts and script-files passed in.
ja: この文書で言うsedスクリプトとは通常、スクリプトまたはスクリプトファイルとして渡されたものを順に連結したものを意味しています。

source: This is equivalent to --in-place=E, creating FILEE as backup of FILE
ja: これは --in-place=E と等価です。入力ファイル FILE のバックアップとして FILEE が作られます。

source: This option can be used with commands like ‘sort -z’ and ‘find -print0’ to process arbitrary file names.
ja: このオプションは ' sort -z 'や ' find -print0 'のようなコマンドと共に使用して任意のファイル名を処理することができます。

source: This option implies -s.
ja: このオプションは'-s'コマンドラインオプションの動作もします。

source: This option is available on every platform, but is only effective where the operating system makes a distinction between text files and binary files.
ja: このコマンドラインオプションは全てのプラットフォームで有効ですが、効果があるのはテキストファイルとバイナリファイルを区別するオペレーティングシステムだけです。

source: This option is available only on platforms that support symbolic links and has an effect only if option -i is specified.
ja: このコマンドラインオプションが有効なのプラットフォームがシンボリックリンクをサポートしていて、かつ、'-i'コマンドラインオプションが指定された時だけです。

source: This option specifies that files are to be edited in-place.
ja: このコマンドラインオプションはコマンドラインパラメータで指定した入力ファイルを直接書き換えます。

source: This rule is followed: if the extension doesn’t contain a *, then it is appended to the end of the current filename as a suffix; if the extension does contain one or more * characters, then each asterisk is replaced with the current filename.
ja: 拡張子が'*'(アスタリスク)を含んでない場合は、拡張子を現在のファイル名の末尾に接尾辞(サフィックス)として追加します。拡張子が1つ以上の'*'(アスタリスク)を含んでいる場合は、拡張子の中の各'*'を現在のファイル名に置換したものをバックアップファイル名とします。

source: To force sed to process octets separately, use the C locale (also known as the POSIX locale):
ja: 1オクテット(1バイト)単位の処理をsedに強制したいときは、（POSIXロケールとして知られている）Cロケールを使って下さい。

source: Treat the input as a set of lines, each terminated by a zero byte (the ASCII ‘NUL’ character) instead of a newline.
ja: 入力されるデータの区切りが改行コードではなくASCIIの ‘NUL’ 文字（\x00）文字で終わっているものとして扱います。

source: Unless special commands (like ‘D’) are used, the pattern space is deleted between two cycles.
ja: （Dコマンドのような)特殊コマンドが使われてない限り、次のサイクルを開始する前にパターンスペースの内容を削除します。

source: Upper/Lower case conversion
ja: (英語の)大文字小文字変換

source: Use -i to edit files in-place instead of printing to standard output.
ja: -iコマンドラインオプションを指定すると、標準出力の代わりに、コマンドラインで指定した入力ファイル自身を編集する。

source: Use -n to suppress output, and the p command to print specific lines.
ja: -n コマンドラインオプションは出力を抑制し、'p'コマンドは指定の行をプリントします。

source: Use -s to reverse this behavior.
ja: -sコマンドラインオプションを使うとこの振る舞いを逆にします。

source: Use extended regular expressions rather than basic regular expressions.
ja: 基本正規表現ではなく拡張正規表現を使います。

source: Used carelessly (and without an explicit p command), the output file will be empty:
ja: よって不用意に(明示的な'p’コマンドを無しで)使われると、ファイルの中身を空にしてしまいます。

source: Using D,G,H,N,P to process multiple lines
ja: D,G,H,N,P コマンドで複数行処理

source: Using a semicolon leads to undesirable results:
ja: そこでセミコロンを使用すると残念な結果になります。

source: Using newlines is most natural when running a sed script from a file (using the -f option).
ja: sedスクリプトを（ -fオプションを指定して）ファイルとして与える時は改行で区切るのが最も自然な方法です。

source: When such a distinction is made—as is the case for MS-DOS, Windows, Cygwin—text files are composed of lines separated by a carriage return and a line feed character, and sed does not see the ending CR.
ja: そのように区別される—MS-DOS、Windows、Cygwinのような—オペレーティングシステムではテキストファイルはキャリッジリターン(CR;\x0d)とラインフィード(LF;\x0a)で区切られた行で構成され、sedは終わりのCRを通常の1文字扱いするのではなく無視するという特殊動作をします。

source: When the end of the file is reached, the temporary file is renamed to the output file’s original name.
ja: ファイルのEOFに到達すると、テンポラリファイルは入力ファイルに上書きされます。

source: When the end of the script is reached, unless the -n option is in use, the contents of pattern space are printed out to the output stream, adding back the trailing newline if it was removed.8 Then the next cycle starts for the next input line.
ja: スクリプトの最後まで到達した時(-nが指定されてなければ)、最初に一行読み込む時に削除した行末の改行を戻してから(読み込む時に行末の改行を削除してなかったらそのまま)、パターンスペースの内容を出力ストリームにプリントアウトします。8 それから次の入力行の為のサイクルを開始します。

source: When the program terminates, the end-of-cycle actions are performed, and the entire pattern space is printed.
ja: プログラムが終了する時はサイクル終了のアクションが実行されます。つまりパターンスペースの内容がプリントされます。

source: When this option is specified, sed will open input files in binary mode, thus not requesting this special processing and considering lines to end at a line feed.
ja: このオプションが指定されるとsedは入力ファイルをバイナリモードで開きます。 つまり、sedはこの特殊動作をせず、単純に行はラインフィード(LF;\x0a)で終了するとして動作します。

source: While in some ways similar to an editor which permits scripted edits (such as ed), sed works by making only one pass over the input(s), and is consequently more efficient.
ja: (edのような)スクリプトの編集を許可するエディタに似ていますが、sedは入力を1passで処理するので、より効率的です。

source: Without -e or -f options, sed uses the first non-option parameter as the script, and the following non-option parameters as input files.
ja: '-e'や'-f'コマンドオプション無しだとsedは最初のコマンドラインオプションでない('-','--'で始まっていない)コマンドラインパラメータをスクリプトとして使い、それ以降のコマンドラインオプションでないコマンドラインパラメーター達を入力ファイル達として使います。

source: Without parameters, the e command executes the command that is found in pattern space and replaces the pattern space with the output; a trailing newline is suppressed.
ja: eコマンドをパラメータ無しに実行すると、パターンスペース内に見つけたコマンドを実行し、パターンスペースをそのコマンドの実行結果で置き換えます（末尾の改行は抑制されます）。

source: Write to the given filename the portion of the pattern space up to the first newline.
ja: パターンスペースの先頭から最初の改行(改行含む)までの内容を、与えられたファイル名のファイルに書き込みます。

source: branch conditionally (that is: jump to a label) only if a s/// command has succeeded since the last input line was read or another conditional branch was taken.
ja: 条件分岐。最後に読み込まれた入力行のs///コマンドが成功し、かつ、まだ他の条件分岐が実行されてない場合に分岐実行する（指定のラベルへジャンプ)。

source: branch unconditionally (that is: always jump to a label, skipping or repeating other commands, without restarting a new cycle).
ja: 無条件分岐（指定のラベルへジャンプ。当該スクリプトの中で前にジャンプしてループを構成するのに使ったり、条件と組み合わせてelse部分をスキップするのに使える。あくまで当該スクリプトの中でジャンプするだけで当該サイクルを終了したり次のサイクルを開始することはない）

source: delete (clears) the current pattern space, and restart the program cycle without processing the rest of the commands and without printing the pattern space.
ja: パターンスペースの内容を全部クリアし、このコマンド以降のスクリプトの実行をスキップしてパターンスペースの内容をプリントせずに次のサイクルを開始する。

source: delete the contents of the pattern space up to the first newline, and restart the program cycle without processing the rest of the commands and without printing the pattern space.
ja: パターンスペースの最初の改行まで(その改行含む)削除し、このコマンド以降のスクリプトの実行をスキップしてパターンスペースの内容をプリントせずに次のサイクルを開始する。

source: insert text before a line (alternative syntax).
ja: 行の前に text を挿入する(代替構文)。

source: insert text before a line.
ja: 行の前に text を挿入する。

source: sed, a stream editor
ja: ストリームエディタsed

source: selecting a range of lines
ja: 行の範囲選択

source: selecting lines by numbers
ja: 数値による行の選択

source: selecting lines by text matching
ja: テキストマッチによる行の選択

source: similar but opposite to the t command: branch only if there has been no successful substitutions since the last input line was read.
ja: tコマンドと逆に、最後に読み込まれた入力行のs///コマンドが失敗した場合に分岐する。

source: • Addresses overview:
ja: • アドレス概要:

source: • Branching and flow control:
ja: • 分岐と制御構文:

source: • Command and Option Index:
ja: • sedコマンドとコマンドラインオプションの索引:

source: • Command-Line Options:
ja: • コマンドラインオプション:

source: • Common Commands:
ja: • 一般コマンド達:

source: • Concept Index:
ja: • 概念索引:

source: • Examples:
ja: • 例:

source: • Execution Cycle:
ja: • 実行サイクル:

source: • Exit status:
ja: • sed終了ステータス:

source: • Extended Commands:
ja: • 拡張コマンド:

source: • Hold and Pattern Buffers:
ja: • ホール用バッファとパターン用バッファ:

source: • Introduction:
ja: • はじめに:

source: • Invoking sed:
ja: • sedの起動:

source: • Limitations:
ja: • 制限:

source: • Multiline techniques:
ja: • 複数行テクニック:

source: • Multiple commands syntax:
ja: • 複数コマンド構文:

source: • Numeric Addresses:
ja: • 数値指定アドレス:

source: • Other Commands:
ja: • 他のコマンド達:

source: • Other Resources:
ja: • 資料:

source: • Overview:
ja: • 概要:

source: • Programming Commands:
ja: • プログラミングコマンド達:

source: • Range Addresses:
ja: • 範囲アドレス:

source: • Regexp Addresses:
ja: • 正規表現アドレス:

source: • Reporting Bugs:
ja: • 報告済のバグ:

source: • The "s" Command:
ja: • "s"コマンド:

source: • advanced sed:
ja: • sedの高度な話題:

source: • sed addresses:
ja: • sedアドレス:

source: • sed commands list:
ja: • sedコマンド一覧:

source: • sed regular expressions:
ja: • sed正規表現:

source: • sed script overview:
ja: • sedスクリプト概要:

source: • sed scripts:
ja: • sedスクリプト:
